AlsultanNabeel/sandy-backend/firmware/brain-core/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32s3"

# Flash — N16R8: 16MB QIO 80MHz
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# PSRAM — N16R8: 8MB OPI (octal)
CONFIG_ESP32S3_SPIRAM_SUPPORT=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_BOOT_INIT=y

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Disable Bluetooth — saves ~100KB RAM
CONFIG_BT_ENABLED=n

# Log level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# Task Watchdog (5s)
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=5
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=n
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=n

# MQTT buffer
CONFIG_MQTT_BUFFER_SIZE=1024
CONFIG_MQTT_OUTBOX_EXPIRED_TIMEOUT_MS=30000

# TLS cert bundle — lets the /voice WSS client verify Heroku's cert
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# OTA — HTTPS only for the pull path (ota_trigger). The push path is the board's
# own HTTP server on the LAN, which is a different thing.
CONFIG_OTA_ALLOW_HTTP=n

# Rollback. A freshly flashed image boots as PENDING_VERIFY and must declare
# itself healthy; reboot without declaring, and the bootloader goes back to the
# previous image on its own.
#
# This matters here because flashing is done over Wi-Fi. Without it, one bad
# image that boots but cannot reach the network takes the recovery path with it
# and the only way back is a cable. With it, the worst case is a robot that
# reboots once and comes back on the firmware that worked.
#
# "Healthy" is defined in sandy_ota.c as: Wi-Fi associated and the update server
# listening — i.e. still rescuable. Deliberately not "the cloud answers", or a
# home-internet outage would roll back perfectly good firmware.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# ADC
CONFIG_ADC_ONESHOT_CTRL_FUNC_IN_IRAM=y

# Stack sizes
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096

# LVGL — SPI panels need byte-swapped RGB565 (else blue renders as green)
CONFIG_LV_COLOR_16_SWAP=y

# ESP-SR wake word: only pack "Hi Andy" (wn9_hiandy_tts2) into the model
# partition — closest built-in to "Sandy". NSN/VAD stay on WebRTC (no model
# files), so the model partition holds just this one ~300KB wake word.
# Swap for a custom-trained "Sandy" model later by changing this line.
CONFIG_SR_WN_WN9_HIANDY_TTS2=y

# ESP-SR offline command words (MultiNet, English, quant8 = smallest, ~2.1MB).
# Lets the device recognize a fixed list of "Sandy ..." phrases fully on-device
# (no cloud), e.g. "Sandy turn on the light". The phrase list + actions live in
# sandy_voice.c (SANDY_COMMANDS table). Needs the enlarged 4MB model partition
# — wake word + this model don't fit the old 2MB.
CONFIG_SR_MN_EN_MULTINET5_SINGLE_RECOGNITION_QUANT8=y

# TLS buffers from PSRAM: two TLS sessions (MQTT broker + voice WSS) ran the
# internal heap dry — the voice handshake died with create_ssl_handle failed
# the moment MQTT held its connection. 8MB PSRAM carries them both easily.
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y

# WiFi + lwip buffers from PSRAM too. Adding the MultiNet command model dropped
# internal SRAM to ~32KB free, and the voice WSS write then failed (net send
# couldn't get a buffer). Moving WiFi/lwip allocations to PSRAM (4MB+ free)
# gives the TLS/network path its internal headroom back.
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
# ...and push generic allocations >4KB (esp-sr MultiNet/AEC working buffers) to
# PSRAM instead of internal SRAM. WiFi-in-PSRAM alone wasn't enough; the model's
# own internal buffers were the real hog (internal dropped to ~18KB at idle).
# DMA-tagged allocs still force internal, so audio I/O is unaffected.
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_ESP_SYSTEM_PANIC_REBOOT_DELAY_SECONDS=3
